'''
Инкапсуляция - возможность скрыть различные 
атрибуты и методы класса от других

Модификаторы доступа:
1) public - публичный доступ - возможно обратиться к свойству или методу 
из любого другого класса или экземпляра

2) protected - защищенный доступ - возможно обратиться к свойству или 
методу из класса и из его классов наследников
Обозначение: self._name или def _method(self)

3) private - частный доступ - возможно обратиться к свойствам 
или методам только из самого класса или экземпляра
Обозначение: self.__name или def __method(self)
'''