'''
ООП - Объектно-ориентированное программирование
- методология программирования, основанная на представлении программы 
в виде совокупности взаимодействующих объектов, каждый из которых является 
экземпляром определенного класса, а классы образуют иерархию наследования

Инкапсуляция - свойство системы, позволяющее объединить данные и методы, 
работающие с ними в одном классе

Наследования - свойство системы, позволяющее описать новый класс на основе уже 
существующего с частично или полностью заимствованной функциональностью.
Класс, от которого производится наследование, называется базовым (родительским, 
или суперклассом). Новый класс - потомком, наследником, дочерним или 
производственным классом.

Полиморфизм - свойство системы, позволяющее использовать объекты с одинаковым 
интерфейсом без информации о типе и внутренней структуре объекта

Класс - универсальный, комплексный тип данных, состоящий из тематически единого 
набора полей (переменных более элементарных типов) и методов (функций для работы 
с этими полями).

'''