"""
Вычислить число c заданной точностью *d*
Пример:
при d = 0.001, π = 3.141
при d = 0.1, π = 3.1
при d = 0.00001, π = 3.14154
d от 0.1 до 0.0000000001

"""

from math import *

x = float(input('Введите точность: '))

d = int(log10(1/x))
print(d, pi)
print(round(pi, d))
