"""
ОСНОВЫ ТЕСТИРОВАНИЯ

Тестирование ПО - исследование, проводимое с целью предоставления 
информации о качестве тестируемого программного продукта 
или услуги

Функциональное тестирование:
* Модульное
* Компонентное
* Системное
* Регрессионное
* Приемочное
* Смоук

2. Тестирование производительности:
* Тестирвоание отказоустойчивости
* Нагрузочное
* Объемное
* Тестирование масштабируемости

3. Обслуживание (регресс и обслуживание):
* Регрессионное
* Тестирование технического обслуживания


"""