'''
Списки (list)

Массив(array) - непрерывная область оперативной памяти, 
которая поделена на ячейки равного размера

Список(linked list) - непрерывная область в опер.памяти, 
которая хранит отдельно хранит необходимые нам данные и 
отдельны ссылку на какой-то следующий объект

Списки (list) в Python - дмнамический массив, в котором 
хранятся указатели на объекты, которые мы храним в списке

'''

# Создание списка:
list_1 = list()     # пустой список
list_2 = list((3.14, True, 'Hello world'))

# более быстрая реализация
list_3 = []
list_4 = [3.14, True, 'Hello world']
