'''
Атрибуты - это переменные, конкретные характеристики объекта, 
такие как цвет поля или имя пользователя
Методы - это функции, которые описаны внутри объекта или класса.

Например,
Объект - это машина
Атрибуты - это цвет, марка, колеса и др.запчасти
Методы - это движение вперед, назад, остановка, ускорение
'''

print('Hello world'.__doc__)        # дандер-атрибут doc (с двумя нижними подчеркиваниями) показывает жокументацию об этом объекте
print(str.__doc__)


print('Hello world!'.upper())
print('Hello world!'.count('l'))
