'''Задание №1

Вспомните какие модули вы уже проходили на курсе.
Создайте файл, в котором вы импортируете встроенные в
модуль функции под псевдонимами. (3-7 строк импорта).
'''
import math
import random
import sys
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
import seaborn as sns

x = np.array([1,2,3])
print(x)
